/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-30
** 作    者：   王飞龙
**---------------------------------------------------------------
** 文 件 名：   AM2301.c
** 文件说明：   环境温湿度模块
*****************************************************************/
/*---------------------INCLUDES----------------------*/
#include "AM2301.h"

/*---------------------VARIABLES---------------------*/
unsigned char RecData[5];
unsigned char TempAnsFlag,TempErrorFlag; 

/*---------------------FUNCTIONS---------------------*/
/***********************************************************************
** 函 数 名： AM2301Start()
** 函数说明： 初始化AM2301
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void AM2301Start()
{
	TEMP_SDA=0;
	TDelay_N1ms(5);	//延时6ms
	TEMP_SDA=1;
	Delay_N10us(3);//延时30us
	TEMP_SDA=1;
	TempAnsFlag=0;
	TempErrorFlag=0;
}
/***********************************************************************
** 函 数 名： AM2301SingleRec()
** 函数说明： 接收AM2301数据
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： unsigned char
***********************************************************************/
unsigned char AM2301SingleRec()
{
	unsigned char i,buf=0,tmp,cnt;
	
	for(i=0;i<8;i++)
	{
		cnt=0;
		while(!TEMP_SDA){if(++cnt>=200){break;}}
	  Delay_N10us(4);//延时40us
		tmp=TEMP_SDA;
		cnt=0;
		while(TEMP_SDA){if(++cnt>=200){break;}}
		buf<<=1;
		buf|=tmp;
	}
	return buf; 	
}
/***********************************************************************
** 函 数 名： DataCheck()
** 函数说明： 接收AM2301数据校验
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： unsigned char
***********************************************************************/
unsigned char DataCheck()
{
	if((RecData[0]+RecData[1]+RecData[2]+RecData[3])==RecData[4])
	{
		return 1;
	}
	return 0;
}
/***********************************************************************
** 函 数 名： H_T_Caculate()
** 函数说明： 数据湿度、温度计算
**---------------------------------------------------------------------
** 输入参数： unsigned char a[]
** 返回参数： unsigned int
***********************************************************************/
unsigned int H_T_Caculate(unsigned char *a)//湿度、温度计算
{
	unsigned int result;
	result=a[0];
	result=result<<8;
	result|=a[1];
	return result;	
} 
/***********************************************************************
** 函 数 名： AM2301()
** 函数说明： 使用AM2301时调用此函数，获得温湿度，注：温度与湿度需外部定义
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： unsigned char
***********************************************************************/
unsigned char AM2301()//使用AM2301时调用此函数
{
	unsigned char i;
	unsigned char cnt;
	AM2301Start();
	if(TEMP_SDA==0)
	{
		TempAnsFlag=1;
		cnt=0;
		while(!TEMP_SDA)
		{
			if(++cnt>300)
			{
				 TempErrorFlag=1;
				 return 0;
			}
		}
		cnt=0;
		while(TEMP_SDA)
		{
			if(++cnt>300)
			{
				 TempErrorFlag=1;
				 return 0;
			}	
		}
		for(i=0;i<5;i++)
		{
			RecData[i]=AM2301SingleRec();
		}
	}
	else
	{
		TempAnsFlag=0;
		return 0;
	}
	
	if(TempAnsFlag)
	{
		if(DataCheck())
		{
			DateHumidity=H_T_Caculate(RecData);
			DateTemp=H_T_Caculate(RecData+2);
			return 1;
		}
	}
	return 0;				
}