<<<<<<< HEAD
/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-07
** 作    者：   温武军
**---------------------------------------------------------------
** 文 件 名：   DS18B20.c
** 文件说明：   溶液温度测量
*****************************************************************/

/*---------------------INCLUDES----------------------*/
#include "DS18B20.h"

/*---------------------VARIABLES---------------------*/
int16 LiquidT;
uint8 a[2];

/*---------------------FUNCTIONS---------------------*/
/***********************************************************************
** 函 数 名： delayus(unsigned int b)
** 函数说明： 延时程序-延时1us
**---------------------------------------------------------------------
** 输入参数： uint32
** 返回参数： 无
***********************************************************************/
//该函数时间与晶振频率有关，此处为24Mhz
void delayus(unsigned int b)
{
   while (b--)
   {
       _nop_();_nop_();_nop_();_nop_();_nop_(); _nop_();_nop_();_nop_();_nop_();_nop_();
	   _nop_();_nop_();_nop_();_nop_();_nop_(); _nop_();_nop_();_nop_();_nop_();_nop_();
	   _nop_();_nop_();_nop_();_nop_();
   }
}
/***********************************************************************
** 函 数 名： DS18B20rest()
** 函数说明： 复位DS18B20
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8
***********************************************************************/
unsigned char DS18B20rest()
{
	//unsigned char a;用于复位检测
	DQ=1;
	delayus(10);
	DQ=0;
	delayus(800);
	DQ=1;
	delayus(600);
	return 1;
}
/***********************************************************************
** 函 数 名： write_byte()
** 函数说明： 写一个字节
**---------------------------------------------------------------------
** 输入参数： uint8
** 返回参数： 无
***********************************************************************/
void write_byte(unsigned char dat)
{
	unsigned char i;
	unsigned char temp;
	for(i=0;i<8;i++)
	{
		temp=dat&0x01;
		DQ=0;
		delayus(15);
		DQ=dat&0x01;
		delayus(45);
		DQ=1;
		delayus(10);
		dat=dat>>1;
	}
	//delayus(100);
}
/***********************************************************************
** 函 数 名： read_byte()
** 函数说明： 读一个字节
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8
***********************************************************************/
unsigned char read_byte()
{
	unsigned char i;
	unsigned char val;
	for(i=0;i<8;i++)
	{
		val>>=1;
		DQ=0;	
		delayus(2);
		DQ=1;
		delayus(4);
		if(DQ)
		{
			val=val|=0x80;
		}
		delayus(30);
	}
	return val;
}
/***********************************************************************
** 函 数 名： DS18B20Start()
** 函数说明： 启动DS18B20
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8
***********************************************************************/
unsigned char DS18B20Start()
{
	unsigned char a;
	a=DS18B20rest();
	if(a)
	{
		write_byte(0xcc);
		write_byte(0x44);
		return 1;
	}
	else 
		return 0;
}
/***********************************************************************
** 函 数 名： DS18B20()
** 函数说明： 再次启动DS18B20，并获得温度数据
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： int16(已转换好的温度)
***********************************************************************/
int DS18B20()
{
	//unsigned int TX,TZ;
	unsigned char b;
	float tt=0;
	b=DS18B20rest();
	if(b)
	{
		write_byte(0xcc);
		write_byte(0xbe);
		a[0]=read_byte();//低位
		a[1]=read_byte();//高位
		DQ=1;
	}
	LiquidT=a[1];
	LiquidT=LiquidT<<8;
	LiquidT=LiquidT|a[0];
	//TZ=(DS18B.a[0]>>4)|((DS18B.a[1]<<4)&0x3f);//温度整数部分
	//TX=DS18B.a[0]<<4;//温度小数部分
	tt=LiquidT*0.0625;
	LiquidT=tt*10+0.5;
	return LiquidT;
=======
/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-07
** 作    者：   温武军
**---------------------------------------------------------------
** 文 件 名：   DS18B20.c
** 文件说明：   溶液温度测量
*****************************************************************/

/*---------------------INCLUDES----------------------*/
#include "DS18B20.h"
#include "intrins.h"

/*---------------------VARIABLES---------------------*/
int8 LiquidT;
uint8 a[2];

/*---------------------FUNCTIONS---------------------*/
/***********************************************************************
** 函 数 名： delayus(unsigned int b)
** 函数说明： 延时程序-延时1us
**---------------------------------------------------------------------
** 输入参数： uint32
** 返回参数： 无
***********************************************************************/
//该函数时间与晶振频率有关，此处为24Mhz
void delayus(unsigned int b)
{
   while (b--)
   {
       _nop_();_nop_();_nop_();_nop_();_nop_(); _nop_();_nop_();_nop_();_nop_();_nop_();
	   _nop_();_nop_();_nop_();_nop_();_nop_(); _nop_();_nop_();_nop_();_nop_();_nop_();
	   _nop_();_nop_();_nop_();_nop_();
   }
}
/***********************************************************************
** 函 数 名： start()
** 函数说明： 复位DS18B20
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8
***********************************************************************/
unsigned char start()
{
	//unsigned char a;用于复位检测
	DQ=1;
	delayus(10);
	DQ=0;
	delayus(800);
	DQ=1;
	delayus(600);
	return 1;
}
/***********************************************************************
** 函 数 名： write_byte()
** 函数说明： 写一个字节
**---------------------------------------------------------------------
** 输入参数： uint8
** 返回参数： 无
***********************************************************************/
void write_byte(unsigned char dat)
{
	unsigned char i;
	unsigned char temp;
	for(i=0;i<8;i++)
	{
		temp=dat&0x01;
		DQ=0;
		delayus(15);
		DQ=dat&0x01;
		delayus(45);
		DQ=1;
		delayus(10);
		dat=dat>>1;
	}
	//delayus(100);
}
/***********************************************************************
** 函 数 名： read_byte()
** 函数说明： 读一个字节
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8
***********************************************************************/
unsigned char read_byte()
{
	unsigned char i;
	unsigned char val;
	for(i=0;i<8;i++)
	{
		val>>=1;
		DQ=0;	
		delayus(2);
		DQ=1;
		delayus(4);
		if(DQ)
		{
			val=val|=0x80;
		}
		delayus(30);
	}
	return val;
}
/***********************************************************************
** 函 数 名： DS18B20Start()
** 函数说明： 启动DS18B20
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8
***********************************************************************/
unsigned char DS18B20Start()
{
	unsigned char a;
	a=start();
	if(a)
	{
		write_byte(0xcc);
		write_byte(0x44);
		return 1;
	}
	else 
		return 0;
}
/***********************************************************************
** 函 数 名： DS18B20()
** 函数说明： 再次启动DS18B20，并获得温度数据
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： int16(已转换好的温度)
***********************************************************************/
int DS18B20()
{
	//unsigned int TX,TZ;
	unsigned char b;
	float tt=0;
	b=start();
	if(b)
	{
		write_byte(0xcc);
		write_byte(0xbe);
		a[0]=read_byte();//低位
		a[1]=read_byte();//高位
		DQ=1;
	}
	LiquidT=a[1];
	LiquidT=LiquidT<<8;
	LiquidT=LiquidT|a[0];
	//TZ=(DS18B.a[0]>>4)|((DS18B.a[1]<<4)&0x3f);//温度整数部分
	//TX=DS18B.a[0]<<4;//温度小数部分
	tt=LiquidT*0.0625;
	LiquidT=tt*10+0.5;
	return LiquidT;
>>>>>>> e5d573584f862271cf5337b8bcc1000895a28f7f
}