/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-08
** 作    者：   温武军
**---------------------------------------------------------------
** 文 件 名：   EC.h
** 文件说明：   电导率测量头文件
*****************************************************************/
#ifndef EC_H
#define EC_H
//K=J\R其中K为电导率，J为电导常熟1.035 R为测量的阻抗

/*---------------------INCLUDES----------------------*/
#include ".\Board\Board.h"
#include ".\Drivers\Drivers.h"

/*---------------------DEFINES-----------------------*/
//#define Cgain	(3736830L+413*(ECTemp-22))	//增益系数的倒数
#define Cgain	(3496464L)
#define Cce		1.035					//电导率探头常数
#define SysRes	6.58					//电导率线补偿电阻
#define SysPhase	291.24					//系统相位角 


/*---------------------DECLARES----------------------*/
void InitAD5933(void);
void Read_AD5933_Temperature(void);
float EC(void);


#endif