/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-30
** 作    者：   温武军
**---------------------------------------------------------------
** 文 件 名：   LCD.c
** 文件说明：   串口屏通信
*****************************************************************/
/*---------------------INCLUDES----------------------*/
#include "LCD.h"

/*---------------------VARIABLES---------------------*/
uint8 xdata lcd_buf[64];
char xdata LCDAck[25];
uint8 LCDReccount=0;//接收数组控制位

/*---------------------FUNCTIONS---------------------*/
/***********************************************************************
** 函 数 名： LCDSend()
** 函数说明： 发送数据到串口屏
**---------------------------------------------------------------------
** 输入参数： uint8 site,uint32 dat
** 返回参数： 无
***********************************************************************/                                                                  
void LCDSend(uint8 site,float dat)
{
	 UartSend3(0xEE);
	 UartSend3(0xB1);UartSend3(0x10);
	 UartSend3(0x00);UartSend3(0x01);
	 UartSend3(0x00);UartSend3((char)site);//控件编号
	 sprintf(lcd_buf,"%.1f",dat);
	 UartSend3_str(lcd_buf);
	 UartSend3(0xFF);UartSend3(0xFC);UartSend3(0xFF);UartSend3(0xFF);
}
/***********************************************************************
** 函 数 名： LCDRec()
** 函数说明： 从串口屏接收数据到单片机
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8(操作码)
***********************************************************************/
uint8 LCDRec()
{
	uint8 j=0;
  if(LCDAck[1])
	{
		j=1;//有泵控制响应
	}
	return j;//没有响应返回0
}
/***********************************************************************
** 函 数 名： LCDAnalyse()
** 函数说明： 从串口屏接收的数据进行分析
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8(操作码)
***********************************************************************/
uint8 LCDAnalyse()
{
	uint8 ACKDate;
	ACKDate=LCDAck[1];
	return ACKDate;
}
/***********************************************************************
** 函 数 名： LCDKeyControl()
** 函数说明： 控制串口屏按键
**---------------------------------------------------------------------
** 输入参数： uint8 site,uint32 dat
** 返回参数： 无
***********************************************************************/  
void LCDKeyControl(uint8 site,uint8 dat)
{
	 UartSend3(0xEE);
	 UartSend3(0xB1);UartSend3(0x10);
	 UartSend3(0x00);UartSend3(0x01);//画面ID
	 UartSend3(0x00);UartSend3(site);//控件编号
	 UartSend3(dat);//按键状态
	 UartSend3(0xFF);UartSend3(0xFC);UartSend3(0xFF);UartSend3(0xFF);
}
/***********************************************************************
** 函 数 名： LCDTypeRead()
** 函数说明： 读取串口屏数据
**---------------------------------------------------------------------
** 输入参数： uint8 FaceID,uint8 site
** 返回参数： 无
***********************************************************************/  
void LCDTypeRead(uint8 FaceID,uint8 site)
{
	 UartSend3(0xEE);
	 UartSend3(0xB1);UartSend3(0x11);
	 UartSend3(0x00);UartSend3(FaceID);
	 UartSend3(0x00);UartSend3(site);//控件编号
	 UartSend3(0xFF);UartSend3(0xFC);UartSend3(0xFF);UartSend3(0xFF);
}