/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-10
** 作    者：   迟旭
**---------------------------------------------------------------
** 文 件 名：   ph.h
** 文件说明：   溶液ph测量头文件
*****************************************************************/
#ifndef _ph_H_
#define _ph_H_

/*---------------------INCLUDES----------------------*/
#include ".\Board\Board.h"
#include ".\Drivers\Drivers.h"

/*---------------------DECLARES----------------------*/
void InitPara(void);
uint16 GetADFilter(uint8 n);
uint16 ph(void);


#endif