/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-14
** 作    者：   温武军
**---------------------------------------------------------------
** 文 件 名：   Wifi.c
** 文件说明：   wifi功能模块(与wifi模块通信有问题)
*****************************************************************/
/*---------------------INCLUDES----------------------*/
#include "Wifi.h"

/*---------------------VARIABLES---------------------*/
//char a[69]="{\"DatasDTO\":[{\"ApiTag\":\"LiquidT\",\"PointDTO\":[{\"Value\":{";
//char value[4]="";
//char b[41]="},\"RecordTime\":\"1531488366\"}]}]}";
char xdata Link[110]="{\"t\": 1,\"device\": \"BlueBerry\",\"key\":\"d9b8d549677e42d989f35401b6c0790f\",\"ver\":\"v1.0\"}";
char xdata Data[80]="{\"t\": 3,\"datatype\":1,\"datas\":{\"Ph\":22.5},\"msgid\": 173}";
char xdata BeatQus[7]="$#AT#\r";
char xdata Ack[64],*JSONp=Ack;

/*---------------------FUNCTIONS---------------------*/
/***********************************************************************
** 函 数 名： WifiRec()
** 函数说明： 接收来自WiFi模块的JSON
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： uint8
***********************************************************************/
uint8 WifiRec()
{
	int j=0;
	char k;
	k=UartRec2();
	{
		while(!k)
		{j++;if(j>300)return 0;}//等待无果返回0
		*JSONp=k;
	}while(JSONp++);
	return 1;//成功返回1
}
/***********************************************************************
** 函 数 名： JsonKeyRec()
** 函数说明： 获取JSON键值
**---------------------------------------------------------------------
** 输入参数： 目标键名，键值储存地址
** 返回参数： uint16,键值的地址
***********************************************************************/
uint16 WifiLinkAck(char *JsonKey)
{
	char *value;
	char *JsonKeyStart;//键名开始的地址
	char *JsonKeyEnd;//键名结束的地址
	char JsonKeyLength;//键名长度
	JsonKeyStart=strstr(JSONp,JsonKey);
	JsonKeyLength=strlen(JsonKey);
	JsonKeyEnd=JsonKeyStart+JsonKeyLength;
	if(JsonKeyStart != 0 && *(JsonKeyStart - 1) == '\"' && *(JsonKeyEnd) == '\"' && *(JsonKeyEnd + 1) == ':' && *(JsonKeyEnd + 2) == '\"' )
	{
		value=JsonKeyEnd+2;
	}
	return value;
}
/***********************************************************************
** 函 数 名： WifiLink()
** 函数说明： 与云平台台建立链接
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void WifiLink()
{
	UartSend2_str(Link);
	//UartSend2_str(Data);
}
/***********************************************************************
** 函 数 名： WifiBeat()
** 函数说明： 与云平台台建立心跳连接
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void WifiBeat()
{
	UartSend2_str(BeatQus);
	//UartSend2_str(Data);
	//UartSend2_str(BeatQus);
}
void Wifidat()
{
	UartSend2_str(Data);
}