/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-08
** 作    者：   温武军
**---------------------------------------------------------------
** 文 件 名：   AD5933.c
** 文件说明：   AD5933的驱动程序
*****************************************************************/

/*---------------------INCLUDES----------------------*/
#include "AD5933.h"


/*---------------------VARIABLES---------------------*/


/*---------------------FUNCTIONS---------------------*/
/***********************************************************************
** 函 数 名： AD5933WriteByte(uint8 Addr,uint8 dat)
** 函数说明： 往AD5933中的Addr中写dat
**---------------------------------------------------------------------
** 输入参数： uint8 Addr,uint8 dat
** 返回参数： 无
***********************************************************************/
void AD5933WriteByte(uint8 Addr,uint8 dat)
{ 
	
	Start();                                    //发送起始命令
	SendData(0x1A);                             //发送设备码加写命令
	RecvACK();
	SendData(Addr);                             //发送存储器地址
	RecvACK();
	SendData(dat);                             //写数据
	RecvACK();
	Stop();                                     //发送停止命令
}
/***********************************************************************
** 函 数 名： AD5933SetPointer(uint8 Addr)
** 函数说明： 设置地址指针
**---------------------------------------------------------------------
** 输入参数： uint8 Addr
** 返回参数： 无
***********************************************************************/
void AD5933SetPointer(uint8 Addr)
{
	Start();                                    //发送起始命令
	SendData(0x1A);                             //发送设备码加写命令
	RecvACK();
	SendData(0xB0);                             //发送指针命令1101 0000
	RecvACK();
	SendData(Addr);                             //发送地址指针
	RecvACK();
	Stop();                                     //发送停止命令
}
/***********************************************************************
** 函 数 名： AD5933Read(uint8 Addr)
** 函数说明： 读取Addr中的数据
**---------------------------------------------------------------------
** 输入参数： uint8 Addr
** 返回参数： uint8 dat
***********************************************************************/
uint8 AD5933Read(uint8 Addr)
{
	uint8 dat;
	AD5933SetPointer(Addr);
	Start();                                    //发送起始命令
	SendData(0x1B);                             //发送设备码加写命令
	RecvACK();
	dat = RecvData();                            //读取数据
	SendNAK();                                   //发送停止命令
	Stop();  
	return  dat;	
}
