/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-08-02
** 作    者：   温武军
**---------------------------------------------------------------
** 文 件 名：   EEPROM.c
** 文件说明：   EEPROM读写功能
*****************************************************************/
/*---------------------INCLUDES----------------------*/
#include "EEPROM.h"

/*---------------------VARIABLES---------------------*/
#define WT_30M          0x80
#define WT_24M          0x81
#define WT_20M          0x82
#define WT_12M          0x83
#define WT_6M           0x84
#define WT_3M           0x85
#define WT_2M           0x86
#define WT_1M           0x87
//测试工作频率为11.0592MHz

/*---------------------FUNCTIONS---------------------*/
/***********************************************************************
** 函 数 名： IapIdle()
** 函数说明： 结束对EEPROM的操作
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void IapIdle()
{
    IAP_CONTR = 0;                              //关闭IAP功能
    IAP_CMD = 0;                                //清除命令寄存器
    IAP_TRIG = 0;                               //清除触发寄存器
    IAP_ADDRH = 0x80;                           //将地址设置到非IAP区域
    IAP_ADDRL = 0;
}
/***********************************************************************
** 函 数 名： IapRead()
** 函数说明： 读对应地址的EEPROM的值
**---------------------------------------------------------------------
** 输入参数： int addr
** 返回参数： 无
***********************************************************************/
char IapRead(int addr)
{
    char dat;

    IAP_CONTR = WT_12M;                         //使能IAP
    IAP_CMD = 1;                                //设置IAP读命令
    IAP_ADDRL = addr;                           //设置IAP低地址
    IAP_ADDRH = addr >> 8;                      //设置IAP高地址
    IAP_TRIG = 0x5a;                            //写触发命令(0x5a)
    IAP_TRIG = 0xa5;                            //写触发命令(0xa5)
    _nop_();
    dat = IAP_DATA;                             //读IAP数据
    IapIdle();                                  //关闭IAP功能

    return dat;
}
/***********************************************************************
** 函 数 名： IapProgram()
** 函数说明： 在对应地址写入某值
**---------------------------------------------------------------------
** 输入参数： int addr, char dat
** 返回参数： 无
***********************************************************************/
void IapProgram(int addr, char dat)
{
    IAP_CONTR = WT_12M;                         //使能IAP
    IAP_CMD = 2;                                //设置IAP写命令
    IAP_ADDRL = addr;                           //设置IAP低地址
    IAP_ADDRH = addr >> 8;                      //设置IAP高地址
    IAP_DATA = dat;                             //写IAP数据
    IAP_TRIG = 0x5a;                            //写触发命令(0x5a)
    IAP_TRIG = 0xa5;                            //写触发命令(0xa5)
    _nop_();
    IapIdle();                                  //关闭IAP功能
}
/***********************************************************************
** 函 数 名： IapErase()
** 函数说明： 清除对应EEPROM地址的值
**---------------------------------------------------------------------
** 输入参数： int addr
** 返回参数： 无
***********************************************************************/
void IapErase(int addr)
{
    IAP_CONTR = WT_12M;                         //使能IAP
    IAP_CMD = 3;                                //设置IAP擦除命令
    IAP_ADDRL = addr;                           //设置IAP低地址
    IAP_ADDRH = addr >> 8;                      //设置IAP高地址
    IAP_TRIG = 0x5a;                            //写触发命令(0x5a)
    IAP_TRIG = 0xa5;                            //写触发命令(0xa5)
    _nop_();                                    //
    IapIdle();                                  //关闭IAP功能
}
/***********************************************************************
** 函 数 名： EEPROMWrite()
** 函数说明： 写入值
**---------------------------------------------------------------------
** 输入参数： int addr, char dat
** 返回参数： 无
***********************************************************************/
void EEPROMWrite(int addr, char dat)
{
    IapErase(addr);                  //addr=0xff
    IapProgram(addr,dat);            //addr=dat
}