/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-08
** 作    者：   温武军 
**---------------------------------------------------------------
** 文 件 名：   UrstTest.h
** 文件说明：   串口异步通讯（目前只有串口1）头文件
*****************************************************************/

#ifndef _URETTEST_H_
#define _URESTEST_H_

/*---------------------INCLUDES----------------------*/
#include ".\Board\Board.h"

/*---------------------DEFINES-----------------------*/
#define FOSC 11059200UL
#define BRT (65536-FOSC/11520/4)

/*---------------------DECLARES----------------------*/
void InitUart1(void);//初始化串口1
void UartSend(unsigned char dat);
void UartSend_Byte(unsigned long dat,unsigned char n);//调用此函数发送

#endif