/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-07
** 作    者：   王老师
**---------------------------------------------------------------
** 文 件 名：   System.c
** 文件说明：   系统功能
*****************************************************************/

/*---------------------INCLUDES----------------------*/
#include ".\Drivers\Drivers.h"
#include ".\Modules\Modules.h"
#include ".\System\System.h"
#include ".\Board\Board.h"

/*---------------------VARIABLES---------------------*/
//生长参数变量储存区
uint16 DateLiquidT;uint16 DateCO2;uint16 DatePh;
uint16 DateHumidity=0;uint16 DateTemp=0;
int32 DateEc;
uint32 DateLux;
//其他控制参数区


/*---------------------FUNCTIONS---------------------*/

/***********************************************************************
** 函 数 名： InitSystem()
** 函数说明： 初始化系统
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void InitSystem(void)
{
	//传感器初始化区域
	InitI2C();
	InitLUX();
  Init_AD();
	InitPh();
	//串口初始化区域
	InitUart1();
	InitUart2();
	//中断或定时器初始化区域
	InterruptKeyIsr();
}
/***********************************************************************
** 函 数 名： StartSystem()
** 函数说明： 运行系统
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void Sensor()
{
	//程序区
	DS18B20Start();
	Read_AD5933_Temperature(); 
	DateEc=EC();
	DateLiquidT=DS18B20();
	DateLux=Get_Lux();
	DateCO2=Get_CO2();
	DatePh=ph();
	WifidatPack();
}
/***********************************************************************
** 函 数 名： StartSystem()
** 函数说明： 运行系统
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void StartSystem(void)
{
	//存储变量区
	TEST=0;//LED亮
	//
    while(1)
    {
			delay1s();
			WifiLink();
			delay_ms(50);
			Sensor();
			delay1s();
			WifiBeat();
			TEST = ~TEST; 
			UartSend1_Byte(0x11,1);
    }

}
