/*****************************************************************
**                   大连理工大学 创新创业学院
**                       物联网应用工坊
**---------------------------------------------------------------
** 项目名称：   WTZP1.0-BlueBerry
** 日    期：   2018-07-07
** 作    者：   王老师
**---------------------------------------------------------------
** 文 件 名：   System.c
** 文件说明：   系统功能
*****************************************************************/

/*---------------------INCLUDES----------------------*/
#include ".\Drivers\Drivers.h"
#include ".\Modules\Modules.h"
#include ".\System\System.h"
#include ".\Board\Board.h"

/*---------------------VARIABLES---------------------*/
//生长参数变量储存区
uint16 DateLiquidT;uint16 DateCO2;uint16 DatePh;
uint16 DateHumidity;uint16 DateTemp;
int16 DateEc;
uint32 DateLux;
//其他控制参数区


/*---------------------FUNCTIONS---------------------*/

/***********************************************************************
** 函 数 名： InitSystem()
** 函数说明： 初始化系统
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void InitSystem(void)
{
	//传感器初始化区域
	InitI2C();
	InitLUX();
  Init_AD();
	InitPh();
	AM2301Start();
	//串口初始化区域
	InitUart1();
	InitUart2();
  InitUart3();
	//中断或定时器初始化区域
	InterruptKeyIsr();
	//植物生长参数控制初始化
  EEPROMWrite(0x0100,0x08);//PH=8
	EEPROMWrite(0x0101,0x08);//低位，EC=1800
	EEPROMWrite(0x0102,0x07);//高位
	//云平台连接
	WifiLink();
}
/***********************************************************************
** 函 数 名： Sensor()
** 函数说明： 传感器数据获取
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void Sensor()
{
	DS18B20Start();
	Read_AD5933_Temperature(); 
	DateEc=(int)EC();
	DateLiquidT=DS18B20();
	DateLux=Get_Lux();
	DateCO2=Get_CO2();
	UartSend1_Byte(0,2);
	DatePh=ph();
	AM2301();
	WifidatPack();
}
/***********************************************************************
** 函 数 名： LCDdisplay()
** 函数说明： 将数据上传至串口屏
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void LCDdisplay()
{
	LCDSend(42,DateLiquidT);//溶液温度
	LCDSend(10,DateCO2);//CO2浓度
	LCDSend(11,DatePh);//PH
	LCDSend(8,DateHumidity);//空气湿度
	LCDSend(7,DateTemp);//空气温度
	LCDSend(12,DateEc);//溶液电导率
	LCDSend(9,DateLux);//光照
}
/***********************************************************************
** 函 数 名： StartSystem()
** 函数说明： 运行系统
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void StartSystem(void)
{
	//存储变量区
	TEST=0;//LED亮
	//
    while(1)
    {
			//WifiLink();
			Sensor();
			//LCDdisplay();
			//AsmControl();
			//WifiBeat();
			TEST = ~TEST;
    }

}
